<a href="https://colab.research.google.com/github/EricOliveira17/Estudos-em-Data-Science-/blob/master/Criando_dataframe_com_dicion%C3%A1rios_de_dados_e_adicionando_nova_linha_.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd 
import numpy  as np

In [2]:
# Criando dicionário de dados com nomes,idades e notas
 
data = {'Nome':['Antonio', 'Maria', 'Paulo', 'Julia'],
        'Idade':[20, 21, 19, 18],
        'Nota':['8.5','9.0','7.0','7.5']}

In [3]:
 
# Criando dataframe pandas com os dados contidos no dicionário 
 
df = pd.DataFrame(data)

In [4]:

# visualização dos dados em forma de tabela 

df

      Nome  Idade Nota
0  Antonio     20  8.5
1    Maria     21  9.0
2    Paulo     19  7.0
3    Julia     18  7.5

In [5]:
# Adicionando dados de um novo aluno 
novo_aluno = ["Renato",18,9.5]

In [6]:
# Atribuindo variável com novo aluno a estrutura do dataframe localizada na região de índice abaixo 
# De acordo ao seu tamanho que seria a posição número 4
# Sabendo que a contagem de índice começa da posição 0
df.loc[len(df)] = novo_aluno

In [7]:
df

      Nome  Idade Nota
0  Antonio     20  8.5
1    Maria     21  9.0
2    Paulo     19  7.0
3    Julia     18  7.5
4   Renato     18  9.5